BurgersFoam/tutorials/onedim_sine_wave/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
800
(
(0.00392698 0 0)
(0.0117807 0 0)
(0.0196337 0 0)
(0.0274855 0 0)
(0.0353356 0 0)
(0.0431835 0 0)
(0.0510287 0 0)
(0.0588708 0 0)
...
)
;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    right
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontBackUpDown
    {
        type            empty;
    }
}


// ************************************************************************* //
